tap "buo/cask-upgrade"
tap "github/gh"
tap "homebrew/bundle"
tap "homebrew/cask"
tap "homebrew/cask-versions"
tap "homebrew/core"
tap "teamookla/speedtest"
brew "python@3.9"
brew "awscli"
brew "certbot"
brew "docker", link: false
brew "gh"
brew "git"
brew "mas"
brew "n"
brew "nano"
brew "nvm"
brew "zsh"
brew "teamookla/speedtest/speedtest"
cask "adobe-creative-cloud"
cask "adoptopenjdk"
cask "adoptopenjdk11"
cask "adoptopenjdk13"
cask "adoptopenjdk8"
cask "alacritty"
cask "discord"
cask "docker"
cask "firefox-developer-edition"
cask "github"
cask "google-backup-and-sync"
cask "google-chrome"
cask "hyper"
cask "iina"
cask "imagealpha"
cask "imageoptim"
cask "jetbrains-toolbox"
cask "keka"
cask "microsoft-auto-update"
cask "microsoft-teams"
cask "mono-mdk-for-visual-studio"
cask "notion"
cask "onedrive"
cask "openemu"
cask "plex-media-player"
cask "skype-for-business"
cask "spotify"
cask "steam"
cask "suspicious-package"
cask "teamviewer"
cask "tower"
cask "transmission"
cask "transmit"
cask "visual-studio"
cask "visual-studio-code"
cask "whatsapp"
