# Taps
tap 'caskroom/cask'
tap 'buo/cask-upgrade'
tap 'caskroom/fonts'
tap 'caskroom/versions'
tap 'homebrew/bundle'
tap 'homebrew/dupes'
tap 'bramstein/webfonttools'

# Install Shells
brew 'zsh'

# Install GNU core utilities (those that come with macOS are outdated)
# Install some other useful utilities like `sponge`.
# Install GNU `find`, `locate`, `updatedb`, and `xargs`, g-prefixed
brew 'coreutils'
brew 'moreutils'
brew 'findutils'

# Install more recent versions of some macOS tools
brew 'grep'
brew 'openssh'
brew 'screen'

# Install Binaries
brew 'ruby'
brew 'python'
brew 'python3'
brew 'awscli'
brew 'git'
brew 'hub'
brew 'tree'
brew 'mackup'
brew 'mas'
brew 'node'
brew 'trash'
brew 'wget'
brew 'ack'
brew 'dark-mode'
brew 'git-lfs'
brew 'lua'
brew 'p7zip'
brew 'rename'
brew 'testssl'
brew 'vbindiff'
brew 'zopfli'
brew 'pv'

#Install Package Managers
brew 'yarn'

# Apps
cask 'google-chrome'
cask 'raindropio'

cask 'atom'
cask 'hyper'
cask 'iterm2'
cask 'github'
cask 'transmit'
cask 'tower'
cask 'mysqlworkbench'
cask 'sequel-pro'
cask 'shuttle'
cask 'jetbrains-toolbox'
cask 'java'

cask 'dropbox'
cask 'google-backup-and-sync'
cask 'backblaze'

cask 'adobe-creative-cloud'
cask 'microsoft-office'

cask 'whatsapp'
cask 'discord'
cask 'slack'
cask 'gitter'
cask 'gpg-suite'

cask 'battle-net'
cask 'steam'

cask 'spotify'
cask 'transmission'
cask 'iina'
cask 'plex-media-player'
cask 'qbittorrent'

cask 'filebot'
cask 'appcleaner'
cask 'parallels'
cask 'bartender'
cask 'keka'
cask 'kap'
cask 'imageoptim'
cask 'spectacle'
cask 'private-internet-access'
cask 'cakebrew'
cask 'ndm'
cask 'macdropany'

# Quicklook
cask 'qlcolorcode'
cask 'qlmarkdown'
cask 'quicklook-json'
cask 'quicklook-csv'
cask 'qlstephen'
cask 'qlprettypatch'
cask 'betterzipql'
cask 'webpquicklook'
cask 'suspicious-package'

# Fonts
cask 'font-source-code-pro'
cask 'font-source-sans-pro'
cask 'font-source-serif-pro'
cask 'font-hack'
cask 'font-fira-code'
cask 'font-andale-mono'
brew 'sfnt2woff'
brew 'sfnt2woff-zopfli'
brew 'woff2'

# Install Mac App Store apps
mas 'Bear', id: 1091189122
mas 'Pages', id: 409201541
mas 'BetterSnapTool', id: 417375580
mas 'Speedtest', id: 1153157709
mas 'Xcode', id: 497799835
mas 'Amphetamine', id: 937984704
