# Taps
tap 'bramstein/webfonttools'
tap 'buo/cask-upgrade'
tap 'caskroom/cask'
tap 'caskroom/fonts'
tap 'caskroom/versions'
tap 'homebrew/bundle'
tap 'homebrew/dupes'

# Install Shells
brew 'zsh'

# Install GNU core utilities (those that come with macOS are outdated)
# Install some other useful utilities like `sponge`.
# Install GNU `find`, `locate`, `updatedb`, and `xargs`, g-prefixed
brew 'coreutils'
brew 'findutils'
brew 'moreutils'

# Install more recent versions of some macOS tools
brew 'grep'
brew 'openssh'
brew 'screen'

# Install Binaries
brew 'ack' # Better Search
brew 'awscli'
brew 'dark-mode' #Toggle Dark Mode from CLI
brew 'git'
brew 'git-lfs'
brew 'hub'#https://hub.github.com
brew 'lua'
brew 'mas'
brew 'mackup' # Backup App settings including dotfiles and others
brew 'node'
brew 'p7zip'
brew 'pv'
brew 'python'
brew 'python@2'
brew 'rename' # More powerful renamer
brew 'ruby'
brew 'testssl'
brew 'trash'
brew 'tree'
brew 'vbindiff'
brew 'wget'
brew 'zopfli'

#Install Package Managers
brew 'yarn'

# Apps
# cask 'adobe-creative-cloud'
cask 'appcleaner'
cask 'atom'
cask 'battle-net'
cask 'cakebrew'
cask 'discord'
cask 'dropbox'
cask 'filebot'
cask 'github'
# cask 'gitter'
cask 'google-backup-and-sync'
cask 'google-chrome'
# cask 'gpg-suite'
cask 'hyper'
cask 'iina'
cask 'imageoptim'
# cask 'iterm2'
cask 'java'
# cask 'jetbrains-toolbox'
# cask 'kap'
cask 'keka'
# cask 'mysqlworkbench'
# cask 'ndm'
# cask 'parallels'
# cask 'plex-media-player'
# cask 'private-internet-access'
# cask 'qbittorrent'
# cask 'raindropio'
# cask 'safari-technology-preview'
# cask 'sequel-pro'
# cask 'shuttle'
# cask 'slack'
# cask 'spectacle'
# cask 'spotify'
cask 'steam'
# cask 'tower'
cask 'transmission'
# cask 'transmit'
cask 'whatsapp'

# Quicklook
cask 'qlcolorcode'
cask 'qlimagesize'
cask 'qlmarkdown'
cask 'qlprettypatch'
cask 'qlstephen'
cask 'qlvideo'
cask 'quicklook-csv'
cask 'quicklook-json'
cask 'quicklookase'
cask 'suspicious-package'
cask 'webpquicklook'

# Fonts
brew 'sfnt2woff'
brew 'sfnt2woff-zopfli'
brew 'woff2'
cask 'font-andale-mono'
cask 'font-fira-code'
cask 'font-hack'
cask 'font-source-code-pro'
cask 'font-source-sans-pro'
cask 'font-source-serif-pro'

# Install Mac App Store apps
mas 'Amphetamine', id: 937984704
mas 'Bear', id: 1091189122
mas 'BetterSnapTool', id: 417375580
mas 'Pages', id: 409201541
mas 'Spark', id: 1176895641
mas 'Speedtest', id: 1153157709
# mas 'Xcode', id: 497799835
